Autodesk.Revit.DB.Architecture.MultistoryStairs.CanDisconnectLevel(Autodesk.Revit.DB.ElementId)
Checks if the given level can be disconnected from multistory stairs.
You cannot disconnect the levels of standard stair (the stair associated with the Reference Level for the multistory stairs) or already disconnected.
levelId:
The id of the level.
Returns:
True if the level id can be used to remove stairs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.CanConnectLevel(Autodesk.Revit.DB.ElementId)
Checks if the given level can be connected into multistory stairs.
You cannot connect levels between standard stairs top and bottom or already connected.
levelId:
The id of the level.
Returns:
True if the level can be connected to this multistory stairs, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.GetStairsOnLevel(Autodesk.Revit.DB.ElementId)
Gets the individual stairs or stairs group on the given base level.
levelId:
The base level id.
Returns:
The id of stairs element on the given level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.Pin(Autodesk.Revit.DB.ElementId)
Restores an unpinned stairs element back into the group of stairs governed by level height.
Remarks:
If the level height of current story can be found among other stories, the stair will be added back into the group;
Otherwise only the status will be changed to "pinned".
levelId:
The base level id.
If the level id belongs to the base level of an individual pinned stairs, it returns the stairs id directly.
Returns:
The stairs element which the pinned story belongs to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no stairs instance at the given base levelId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.Unpin(Autodesk.Revit.DB.ElementId)
Removes a particular story of the stairs (identified by its base level id) from a stairs group.
Remarks:
If the story at the given level is in a group, it will separate an individual stairs element from the group with "unpinned" status. Changes you make to the returned stairs element will not affect any other stairs.
If the story of stairs is already an individual stairs element, the status will be changed to "unpinned".
levelId:
The base level id.
If the level id belongs to the base level of a unpinned stairs element, it returns the stairs id directly.
Returns:
The unpinned stairs element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no stairs instance at the given base levelId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.GetAllConnectedLevels
Gets all connected level ids of this multistory stairs.
Returns:
The ids of connected levels.
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.IsPinned(Autodesk.Revit.DB.Architecture.Stairs)
Checks if a stair is pinned.
stairs:
A stairs element in this multistory stairs element.
Returns:
Returns true if the stairs is pinned; otherwise returns false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input stairs is not a member of this multistory stairs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.GetStairsPlacementLevels(Autodesk.Revit.DB.Architecture.Stairs)
Gets all the levels the given stairs group placed on.
Remarks:
If a stairs element is a stairs group, it gets all the base levels of each member of the group;
If a stairs element is an individual stairs, it just gets the base level of the stairs element.
stairs:
A stairs element in this multistory stairs element.
Returns:
The ids of base levels of the given stairs in this multistory stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input stairs is not a member of this multistory stairs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.GetAllStairsIds
Gets the ids of all the stairs in this multistory stairs.
Remarks:
Stairs elements returned by this method will either be members of groups of identical stairs instances which share the same level height, or individual Stairs instances which are not connected to a group with the same level height.
Use Autodesk.Revit.DB.Architecture.MultistoryStairs.IsPinned(Autodesk.Revit.DB.Architecture.Stairs) to identify if a Stairs is a member of a group or not.
Returns:
The ids of the stairs elements that govern groups of stairs, and the stairs elements that represent individual stairs.
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.DisconnectLevels(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Shrinks the multistory stairs by disconnecting input levels.
Remarks:
If you remove a stairs that is connected at the top and bottom to another level stairs, the remaining stairs will automatically adjust to maintain the multistory stairs.
The stairs above the one that is removed extends to attach to the stairs on the level below the one that is removed.
You cannot disconnect the levels of standard stair (the stair associated with the Reference Level for the multistory stairs) or already disconnected.
levelIds:
The level ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This multistory stairs cannot disconnect from one or more members of levelIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Extends the multistory stairs by connecting input levels.
Remarks:
The added stairs will be categorized into different groups based on level heights automatically. Stairs with the same level height are considered a group and can be edited together.
You cannot connect the levels between standard stairs top and bottom or already connected.
levelIds:
The level ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This multistory stairs cannot connect to one or more members of levelIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.IsAcceptableForMultistoryStairs(Autodesk.Revit.DB.Architecture.Stairs)
Checks if the given stairs can be used to create a multistory stairs.
stairs:
The given stairs to check.
Returns:
Returns true if the stairs can be used to create a multistory stairs; otherwise returns false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.Create(Autodesk.Revit.DB.Architecture.Stairs)
Creates a multistory stairs from an existing component-based stairs.
stairs:
A component-based stairs.
Returns:
The newly created element.  Use Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId}) to extend this to multiple stories and generate stairs groups for each level height.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.StandardStairsId
Id of the stair associated with the Reference Level for the multistory stairs.
The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs.ActualTreadDepth
The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
Remarks:
In a multistory stairs, all the stairs elements keep the same tread depth parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet.
Since:
2018

Autodesk.Revit.DB.Architecture.MultistoryStairs
Represents a multistory stairs element in Autodesk Revit.
Remarks:
A multistory stairs element may contain multiple stairs whose extents are governed by base and top levels.
Use Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId}) and Autodesk.Revit.DB.Architecture.MultistoryStairs.DisconnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId}) to add and remove connected levels to a multistory stairs element.
This element will contain one or more Stairs elements.  These can be obtained via Autodesk.Revit.DB.Architecture.MultistoryStairs.GetAllStairsIds and Autodesk.Revit.DB.Architecture.MultistoryStairs.GetStairsOnLevel(Autodesk.Revit.DB.ElementId).
Stairs elements are either a reference instance which is copied to each level covered by groups of identical stairs instances which share the same level height,
or individual Stairs instances which are not connected to a group with the same level height.  By default, when adding new levels to the multistory stair,
new stairs will be added to the group (shown in the Revit user interface with a 'Pin' icon).
For groups of duplicate stairs at different levels, the instances can be found as Subelements of the Stairs element (see
Autodesk.Revit.DB.Element.GetSubelements.
Stairs in a connected group can be edited together by modifying the associated Stairs instance. For specific floors that need special designs,
stairs can be separated from a group by unpinning the element, changes made to this Stairs will not affect other any other instance in the element.
Use Autodesk.Revit.DB.Architecture.MultistoryStairs.Unpin(Autodesk.Revit.DB.ElementId) for this.
You can add the stairs back into the group via Autodesk.Revit.DB.Architecture.MultistoryStairs.Pin(Autodesk.Revit.DB.ElementId) if needed. However, any changes made to the stair will be lost since the stair's properties
will be overridden by the group specifications.
Since:
2018